---
type: SketchPlane
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# SketchPlane

`Autodesk.Revit.DB.SketchPlane` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | GetPlane | 2014 | `public Plane GetPlane ()` |
| Method | GetPlaneReference | 2014 | `public Reference GetPlaneReference ()` |
| Property | IsSuitableForModelElements | — | `public bool IsSuitableForModelElements { get ; }` |
| Property | Parameter | — | `` |